<?php
//***********************************************************************
// Назначение: Передача товаров из 1С в virtuemart
// Модуль: translit.php - Транслит кирилицы в латиницу
// Автор оригинала: Дуденков М.В. (email: mihail@termservis.ru)
// Помогали разрабатывать:	Alexandr Datsiuk
//							Павел Михнев
//                          CALEORT
// Авторские права: использовать, а также распространять данный скрипт
//                  разрешается только с разрешением автора скрипта
//***********************************************************************

// функция перевода текста с кириллицы в транслит

function translitString($st)

{

	// Сначала заменяем "односимвольные" фонемы.

   //$st=strtr($st,"абвгдеёзийклмнопрстуфхъыэ_",

   //"abvgdeeziyklmnoprstufh'iei");

   //$st=strtr($st,"АБВГДЕЁЗИЙКЛМНОПРСТУФХЪЫЭ_",

   //"abvgdeeziyklmnoprstufh'iei");

    // Затем - "многосимвольные".

    $st=strtr($st,

                    array(
						"а"=>"a", "б"=>"b", "в"=>"v", "г"=>"g", "д"=>"d", "е"=>"e", "ё"=>"yo", "з"=>"z",
						
						"и"=>"i", "й"=>"y", "к"=>"k", "л"=>"l", "м"=>"m", "н"=>"n", "о"=>"o", "п"=>"p",
						
						"р"=>"r", "с"=>"s", "т"=>"t", "у"=>"u", "ф"=>"f", "х"=>"h", "ъ"=>"", "ы"=>"yi",
						
						"э"=>"ye"
                        )

             );						
   
    $st=strtr($st,

                    array(	
						"А"=>"a", "Б"=>"b", "В"=>"v", "Г"=>"g", "Д"=>"d", "Е"=>"e", "Ё"=>"yo", "З"=>"z",
						
						"И"=>"i", "Й"=>"y", "К"=>"k", "Л"=>"l", "М"=>"m", "Н"=>"n", "О"=>"o", "П"=>"p",
						
						"Р"=>"r", "С"=>"s", "Т"=>"t", "У"=>"u", "Ф"=>"f", "Х"=>"h", "Ъ"=>"", "Ы"=>"yi",
						
						"Э"=>"ye"
                        )

             );					
   
    $st=strtr($st,

                    array(	
                        "ж"=>"zh", "ц"=>"ts", "ч"=>"ch", "ш"=>"sh",

                        "щ"=>"shch","ь"=>"", "ю"=>"yu", "я"=>"ya",

                        "Ж"=>"zh", "Ц"=>"ts", "Ч"=>"ch", "Ш"=>"sh",

                        "Щ"=>"shch","Ь"=>"", "Ю"=>"yu", "Я"=>"ya",

                        "ї"=>"i", "Ї"=>"yi", "є"=>"ie", "Є"=>"ye"

                        )

             );

    // Возвращаем результат.

    return $st;

  }
  
?>